Revit 2027 API
ZoneEquipmentBehavior Enumeration
 The behavior of zone equipment associated with spaces.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum ZoneEquipmentBehavior
Public Enumeration ZoneEquipmentBehavior
public enum class ZoneEquipmentBehavior
type ZoneEquipmentBehavior
Members
Member name | Value | Description
GroupSpaces | 1
OnePerSpace | 0
See Also
Reference
Autodesk.Revit.DB.Mechanical Namespace